historic/moonshot-C15N1/C36N1/results/mixed-402-8to16k_20Mseq.fio.out
randread-8k-16k: (g=0): rw=randread, bs=8K-16K/8K-16K/8K-16K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-8k-16k: (groupid=0, jobs=1): err= 0: pid=3588: Fri May 27 18:26:42 2016
  read : io=34444MB, bw=587841KB/s, iops=54351, runt= 60001msec
    slat (usec): min=2, max=4481, avg= 6.23, stdev=10.14
    clat (usec): min=8, max=144255, avg=176.18, stdev=480.49
     lat (usec): min=35, max=144271, avg=182.54, stdev=480.68
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[  104], 10.00th=[  110], 20.00th=[  118],
     | 30.00th=[  125], 40.00th=[  131], 50.00th=[  139], 60.00th=[  149],
     | 70.00th=[  161], 80.00th=[  181], 90.00th=[  223], 95.00th=[  338],
     | 99.00th=[  796], 99.50th=[ 1240], 99.90th=[ 1640], 99.95th=[ 2256],
     | 99.99th=[11328]
    bw (KB  /s): min=186240, max=741456, per=96.60%, avg=587642.44, stdev=132624.44
    lat (usec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=2.32%, 250=89.86%
    lat (usec) : 500=5.27%, 750=1.44%, 1000=0.39%
    lat (msec) : 2=0.65%, 4=0.03%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=13.12%, sys=44.22%, ctx=1075389, majf=0, minf=49
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=3261149/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=3589: Fri May 27 18:26:42 2016
  read : io=1202.0MB, bw=20513KB/s, iops=20, runt= 60002msec
    slat (usec): min=67, max=949, avg=215.37, stdev=98.92
    clat (usec): min=407, max=95386, avg=1287.80, stdev=4557.80
     lat (usec): min=639, max=95577, avg=1503.60, stdev=4566.44
    clat percentiles (usec):
     |  1.00th=[  548],  5.00th=[  564], 10.00th=[  572], 20.00th=[  596],
     | 30.00th=[  612], 40.00th=[  620], 50.00th=[  636], 60.00th=[  652],
     | 70.00th=[  676], 80.00th=[  708], 90.00th=[ 1048], 95.00th=[ 2288],
     | 99.00th=[20864], 99.50th=[41216], 99.90th=[46848], 99.95th=[95744],
     | 99.99th=[95744]
    bw (KB  /s): min=16062, max=24743, per=3.37%, avg=20531.20, stdev=728.73
    lat (usec) : 500=0.17%, 750=84.44%, 1000=5.07%
    lat (msec) : 2=4.16%, 4=3.24%, 10=1.41%, 20=0.33%, 50=1.08%
    lat (msec) : 100=0.08%
  cpu          : usr=0.03%, sys=0.49%, ctx=2383, majf=0, minf=526
  IO depths    : 1=98.4%, 2=0.3%, 4=0.7%, 8=0.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1202/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=3590: Fri May 27 18:26:42 2016
  write: io=1202.0MB, bw=20513KB/s, iops=20, runt= 60002msec
    slat (usec): min=79, max=1003, avg=191.88, stdev=83.62
    clat (usec): min=478, max=108597, avg=2611.86, stdev=10181.17
     lat (usec): min=802, max=108990, avg=2804.24, stdev=10200.10
    clat percentiles (usec):
     |  1.00th=[  700],  5.00th=[  732], 10.00th=[  852], 20.00th=[  876],
     | 30.00th=[  892], 40.00th=[  900], 50.00th=[  916], 60.00th=[  940],
     | 70.00th=[  956], 80.00th=[  972], 90.00th=[ 1192], 95.00th=[ 7712],
     | 99.00th=[35584], 99.50th=[99840], 99.90th=[107008], 99.95th=[109056],
     | 99.99th=[109056]
    bw (KB  /s): min=14099, max=26499, per=100.00%, avg=20536.20, stdev=935.75
    lat (usec) : 500=0.08%, 750=5.49%, 1000=79.87%
    lat (msec) : 2=8.15%, 4=0.75%, 10=1.00%, 20=2.66%, 50=1.08%
    lat (msec) : 100=0.42%, 250=0.50%
  cpu          : usr=0.16%, sys=0.31%, ctx=2384, majf=0, minf=9
  IO depths    : 1=98.3%, 2=0.3%, 4=0.7%, 8=0.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1202/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=35646MB, aggrb=608344KB/s, minb=20513KB/s, maxb=587840KB/s, mint=60001msec, maxt=60002msec
  WRITE: io=1202.0MB, aggrb=20513KB/s, minb=20513KB/s, maxb=20513KB/s, mint=60002msec, maxt=60002msec

Disk stats (read/write):
  nvme0n1: ios=3269546/10833, merge=0/0, ticks=533760/23072, in_queue=556956, util=99.87%