historic/moonshot-C15N1/C36N1/results/mixed-507-32to64k_uncapped.fio.out
randread-32k-64k: (g=0): rw=randread, bs=32K-64K/32K-64K/32K-64K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-32k-64k: (groupid=0, jobs=1): err= 0: pid=31077: Fri May 27 18:04:33 2016
  read : io=2224.0MB, bw=37950KB/s, iops=831, runt= 60010msec
    slat (usec): min=4, max=14075, avg=77.62, stdev=203.30
    clat (msec): min=3, max=134, avg=11.94, stdev= 4.85
     lat (msec): min=5, max=134, avg=12.01, stdev= 4.85
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   10], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   12], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   13], 90.00th=[   14], 95.00th=[   16],
     | 99.00th=[   30], 99.50th=[   32], 99.90th=[   83], 99.95th=[   99],
     | 99.99th=[  133]
    bw (KB  /s): min=24320, max=44710, per=5.25%, avg=37989.84, stdev=3647.75
    lat (msec) : 4=0.01%, 10=19.15%, 20=77.63%, 50=3.04%, 100=0.14%
    lat (msec) : 250=0.04%
  cpu          : usr=0.77%, sys=7.52%, ctx=41612, majf=0, minf=169
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=49919/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=31078: Fri May 27 18:04:33 2016
  read : io=40209MB, bw=686051KB/s, iops=669, runt= 60016msec
    slat (usec): min=74, max=13509, avg=273.31, stdev=202.46
    clat (msec): min=4, max=134, avg=14.64, stdev= 5.37
     lat (msec): min=5, max=134, avg=14.91, stdev= 5.37
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   12], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   14], 50.00th=[   14], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   16], 90.00th=[   17], 95.00th=[   20],
     | 99.00th=[   33], 99.50th=[   35], 99.90th=[   91], 99.95th=[  110],
     | 99.99th=[  131]
    bw (KB  /s): min=462848, max=755712, per=94.83%, avg=686530.46, stdev=57377.36
    lat (msec) : 10=0.33%, 20=95.28%, 50=4.17%, 100=0.15%, 250=0.07%
  cpu          : usr=0.35%, sys=18.24%, ctx=38157, majf=0, minf=524
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=40209/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=31079: Fri May 27 18:04:33 2016
  write: io=39652MB, bw=676603KB/s, iops=660, runt= 60011msec
    slat (usec): min=86, max=14307, avg=331.76, stdev=222.85
    clat (msec): min=5, max=143, avg=14.79, stdev= 5.39
     lat (msec): min=5, max=143, avg=15.12, stdev= 5.39
    clat percentiles (msec):
     |  1.00th=[   12],  5.00th=[   12], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   14], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   16], 90.00th=[   17], 95.00th=[   19],
     | 99.00th=[   34], 99.50th=[   36], 99.90th=[   90], 99.95th=[  113],
     | 99.99th=[  133]
    bw (KB  /s): min=444416, max=735808, per=100.00%, avg=677484.04, stdev=55026.32
    lat (msec) : 10=0.16%, 20=95.49%, 50=4.12%, 100=0.15%, 250=0.08%
  cpu          : usr=3.95%, sys=17.74%, ctx=40624, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=39652/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=42433MB, aggrb=723996KB/s, minb=37949KB/s, maxb=686050KB/s, mint=60010msec, maxt=60016msec
  WRITE: io=39652MB, aggrb=676603KB/s, minb=676603KB/s, maxb=676603KB/s, mint=60011msec, maxt=60011msec

Disk stats (read/write):
  nvme0n1: ios=411473/356558, merge=0/0, ticks=5682792/5045868, in_queue=10756756, util=100.00%